demo/AskerveinHill-twoDoamins/innerDomain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//vertices
//(
//    ( 581321  4.78537e+06   930)
//    ( 582290  4.78537e+06   930)
//    ( 582290  4.78624e+06   930)
//    ( 581321  4.78624e+06   930)
//    ( 581321  4.78537e+06   1500)
//    ( 582290  4.78537e+06   1500)
//    ( 582290  4.78624e+06   1500)
//    ( 581321  4.78624e+06   1500)

//);

vertices
(
    ( -3000  -3000   0)
    (  3000  -3000   0)
    (  3000   3000   0)
    ( -3000   3000   0)
    ( -3000  -3000   1000)
    (  3000  -3000   1000)
    (  3000   3000   1000)
    ( -3000   3000   1000)

);


blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 20) simpleGrading (1 1 2)
);

edges
(
);

boundary
(
    eastBC
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    northBC
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    southBC
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    
    westBC
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
